# -*- coding: utf-8 -*-

# 分辨率
# 分辨率和位置配置
resolution_ratio = [(1920, 1080), (1920, 1200), (2560, 1440), (2560, 1600), (3840, 2160), (3840, 2400),(3440,1440),(3072,1920)]
resolution_ratio_str = [f"{i}*{j}" for i, j in resolution_ratio]

resolution_position = {}
resolution_position['large'] = {
    # ========== 刷配装得部分 ==========
    "loadout1":(180, 320),  # 配装1的点击位置
    "dy":55,    # 每个配装之间得间隔
    "loadout2":(180, 380),
    "loadout3":(180, 430),
    "loadout4":(180, 490),
    "loadout5":(180, 540),
    "monitor_price": (1220, 917, 110, 16),  # 监控配装处的价格
    "price_change":(305,313,157,28),        # 购买失败或者部分购买的价格变动提醒
    "monitor_price_in_trade":[(1185,907,115,20),(1185,950,115,20)], # 监控交易行处的价格
    "buy": (1340, 920),  # 在配装处点击购买
    "monitor_text": (470, 115, 400, 30),    # 监控购买后是否成功的框
    "confirm_loadout":(1233,975,60,17),     # 用于检测是否在配装页面
    "home_loadout": (1145, 1000),           # 主页面右下角的配装
    "home_text": (1100, 980, 250, 30),      # 监测主页右下角有没有配装
    # ===============================

    # ========== 领邮件得部分 ==========
    "mail": [(1300, 40), (340, 60), (150, 980)],  # 去领邮件
    "mail_region":(1290,20,45,45),      # 检测用不用领邮件
    "mail_wait":(450,300,800,600),      # 等领完邮件
    "mail_green":(312,69,70,12)  ,      # 确保点进交易行邮件
    "mail_green_rb":(1237, 967, 51, 26),# 看看右下角有没有绿色领取
    # ===============================

    # ========== 卖子弹得部分 ==========
    "sell_bullet1": [(960, 455), (710, 280), (1070, 660), (1000, 560), (1070, 620), (1070, 700)],
    "sell_bullet2": [(960, 165), (710, 280), (1070, 660), (1090, 560), (1070, 620), (1070, 700)],
    #               点子弹         出售      上架       选择数量    输入框         出售
    "sell_bullets_detect":(502,104,100,900),   # 在仓库里检测各个子弹的位置
    "胸挂":(605,0,250,0),
    "口袋":(504,0,280,0),
    "背包":(605,0,250,0),
    "安全":(605,0,250,0),
    "sell_bullets_slip":(570,200),         # 需要鼠标下滚
    "sell_bullet_amount": [(1090, 560),(1000, 560),(921,560)],  # 卖子弹时候得3个数量
    'sell_bullet_amount_check':(890,517,56,25),  # 检测游戏是不是出bug了，售卖 0/0
    "sell_price":[(343,690,55,20),(439,690,55,20),(535,690,55,20)], # 前3个价格监测
    "sell_price_input":(950,610,80,20),    # 检测一下卖的时候输入价格对不对
    # ===============================

    # ========== 进入售卖界面得部分 ==========
    "sell_page_detect":(276,347,894,396),  # 在仓库售卖时，检测的页面坐标
    'sell_page_text_detect':(1036,650,35,20),    # 检测游戏是不是卡了，没打开交易页面
    "sell_page_click":(1100,660),          # 在仓库售卖时，选择售卖界面，上架交易行点击位置
    "sell_green": (960, 680, 60, 30),      # 监测售卖页面按钮，变绿说明可以卖了
    "sell_success_green":(540,120,360,20), # 检测在仓库卖完子弹后的绿色提示框
    "sell_yellow": (674, 384, 12, 12),     # 监测是否进入了售卖页面
    "check_bullets": (930, 140, 432, 480), # 在交易行，对仓库截图，识别子弹位置. 10行9列
    "trade": (540, 40),                    # 交易行按钮
    "trade_green": (500, 50, 75, 15),      # 确定在交易行
    "sell": [(180, 80), (260, 80)],        # 交易行界面二级按钮的购买和出售
    "buy_search": (220, 130),              # 点击交易行搜索框
    "buy_search_area": (75, 120, 150, 25), # 交易行搜索框
    # ===============================

    # ========== 游戏主界面得按钮位置 ==========
    "game_corner":(10,10),                # 游戏左上角，主要用于重新获取焦点
    "begin_game":(150,40),                # 开始游戏
    "begin_game_green":(95,55,100,8),     # 开始游戏,监测有没有绿色
    "main_page":(225,30,35,23),           # 烽火得大厅，只要最上面能点到就行
    "main_page_green":(95,55,690,8),      # 烽火得大厅,监测有没有绿色
    "warehouse":(255,45),                 # 点击进入仓库
    "warehouse_green":(220,50,50,15),     # 监测是不是进仓库了
    "warehouse_ctrl_f":(220,1060),        # 点击按钮全部转移
    "warehouse_check_bullets":(930,100,432,480),    # 在仓库监测有没有子弹
    "select_bullets":[(500+350*i,180+120*j) for j in range(2) for i in range(3)], # 屯仓模式下，选择子弹的排列位置
    "min_price_area":(220,130,101,33),  # 用于自动开始任务检测是不是在子弹购买页面
    "esc_click":(120,1060),               # 左下角的esc按钮
    # ===============================

    # ========== 自动返回某一界面是得点击顺序 ==========
    "return_to_loadout":[(1145,1000),(210,140),(630,350),(1250,480),(1270,990),(740,660)],  # 主页面没有配装，多点几次来出配装
    "return_eagle":(82,128,35,35),  # 危险行动的那个鹰
    "return_to_loadout_half":(1200,500,75,25),  # 配装不完全，点一下开始行动
    "return_to_fenghuo":[(220,220),],  # 从大战场回烽火
    "white_spot":(1346,973,13,13),     # 价格加载的白点
    "return_to_dazhanchang":(231,368), # 点击去大战场
    "move_bullets":(690,120,65,20),    # 把子弹放进仓库
    "quit_game":(166,992,72,24),       # 一直按esc，直到出现退出游戏
    # "enter_ss":(160,870,85,25),        # 一直按esc，直到出现“进入特勤处”
    "enter_ss":(158, 887, 84, 32),        # 一直按esc，直到出现“进入特勤处”
    # ===============================

    # ========= 重启游戏的部分 ==========
    "start_game_click":(450,450),

    # ========= 买皮肤的部分 ==========
    "buy_skin_click":(1300,960),    # 买皮肤点击位置
    "buy_skin_green":(1200,950,95,25),    # 检测价格是不是绿色的
    "buy_confirm_click":(975,660),  # 点击后弹出确认购买
    "buy_confirm_green":(900,650,50,30),  # 点击后弹出确认购买的检测区域
    "refresh_button":(1030,130),    # 每次买一个枪皮都要点刷新
}

resolution_position['small'] = {
    "monitor_price": (1155, 198, 120, 15),   # 右上角看余额的区域

    # 下面俩元素分别表示 有兑换时候的按钮 和 没有兑换的按钮,好像实际上竖向只差40像素点
    "buy": [(1280,920), (1280,950)],    # 购买按钮
    "buy1":[(1137,854), (1137,900)],    # 调整数量为1发
    "buy32":[(1166,854),(1166,900)],    # 调整数量为32发
    "buy11":[(1149,854),(1149,900)],    # 调整数量为11发
    "buy200":[(1309,854),(1309,900)],   # 调整数量为200发
    "buy200_near":[(1300,843,15,25),(1300,885,15,25)],  # 检测是不是拉到200附近了
    'buy_amount':[(1211, 818, 32, 18),(1211, 861, 33, 20)],  # 检测一下实际的购买数量
    "buy_amount_minus":[(1120,855),(1120,895)],  # 点一下子弹数量减1
    "buy_with_exchange_box":(1216,908,40,20),   # 有兑换时候的检测位置
    "see_price1":(1280,40),     # 去看余额时鼠标放置得位置
    "buy_in_trade_gray":(924,134,13,13),    # 检测是不是在交易行里面买东西的页面，这个是右上角购买数的灰矩形
}